In [86]:
import numpy as np
import pandas as pd

In [87]:
data= np.random.randn(4,3)
data

array([[-0.98374163, -1.26807813, -1.83637922],
       [ 0.30775996,  2.96723472, -0.5060649 ],
       [ 0.37130474,  0.83140676, -1.73077925],
       [ 1.09260319, -0.97112279,  0.01151621]])

In [88]:
dataFrame = pd.DataFrame(data)
dataFrame[0]
type(dataFrame[0])

pandas.core.series.Series

In [89]:
newDataFrame = pd.DataFrame(data, index=["1. çalışan", "2. çalışan","3. çalışan","4.çalışan"], columns=["maas","yas","calısma saati"])
newDataFrame

                maas       yas  calısma saati
1. çalışan -0.983742 -1.268078      -1.836379
2. çalışan  0.307760  2.967235      -0.506065
3. çalışan  0.371305  0.831407      -1.730779
4.çalışan   1.092603 -0.971123       0.011516

In [90]:
newDataFrame["yas"]

1. çalışan   -1.268078
2. çalışan    2.967235
3. çalışan    0.831407
4.çalışan    -0.971123
Name: yas, dtype: float64

In [91]:
newDataFrame[["maas","yas"]]

                maas       yas
1. çalışan -0.983742 -1.268078
2. çalışan  0.307760  2.967235
3. çalışan  0.371305  0.831407
4.çalışan   1.092603 -0.971123

In [92]:
newDataFrame.loc["1. çalışan"]

maas            -0.983742
yas             -1.268078
calısma saati   -1.836379
Name: 1. çalışan, dtype: float64

In [93]:
newDataFrame.iloc[0]

maas            -0.983742
yas             -1.268078
calısma saati   -1.836379
Name: 1. çalışan, dtype: float64

In [94]:
newDataFrame

                maas       yas  calısma saati
1. çalışan -0.983742 -1.268078      -1.836379
2. çalışan  0.307760  2.967235      -0.506065
3. çalışan  0.371305  0.831407      -1.730779
4.çalışan   1.092603 -0.971123       0.011516

In [95]:
newDataFrame["Emeklilik yaşı"]= newDataFrame["yas"]+newDataFrame["yas"]
newDataFrame

                maas       yas  calısma saati  Emeklilik yaşı
1. çalışan -0.983742 -1.268078      -1.836379       -2.536156
2. çalışan  0.307760  2.967235      -0.506065        5.934469
3. çalışan  0.371305  0.831407      -1.730779        1.662814
4.çalışan   1.092603 -0.971123       0.011516       -1.942246

In [96]:
newDataFrame.drop("calısma saati",axis=1)

                maas       yas  Emeklilik yaşı
1. çalışan -0.983742 -1.268078       -2.536156
2. çalışan  0.307760  2.967235        5.934469
3. çalışan  0.371305  0.831407        1.662814
4.çalışan   1.092603 -0.971123       -1.942246

In [97]:
newDataFrame.loc["1. çalışan"]["maas"]
newDataFrame.loc["2. çalışan", "yas"]

2.9672347216328383

In [98]:
newDataFrame > 0

             maas    yas  calısma saati  Emeklilik yaşı
1. çalışan  False  False          False           False
2. çalışan   True   True          False            True
3. çalışan   True   True          False            True
4.çalışan    True  False           True           False

In [99]:
newDataFrame.reset_index()

        index      maas       yas  calısma saati  Emeklilik yaşı
0  1. çalışan -0.983742 -1.268078      -1.836379       -2.536156
1  2. çalışan  0.307760  2.967235      -0.506065        5.934469
2  3. çalışan  0.371305  0.831407      -1.730779        1.662814
3   4.çalışan  1.092603 -0.971123       0.011516       -1.942246

In [100]:
yeniIndexList=["A","B","C"]

In [101]:
newDataFrame["Yeni Index"]= yeniIndexList
newDataFrame.set_index("Yeni Index", inplace=True)

ValueError: Length of values does not match length of index

In [ ]:
 ilkIndexler =["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [ ]:
icIndexler=["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [ ]:
birlesmisIndex= list(zip(ilkIndexler,icIndexler))
birlesmisIndex

In [ ]:
birlesmisIndex= pd.MultiIndex.from_tuples(birlesmisIndex)

In [ ]:
birlesmisIndex

In [ ]:
cartoonList=[[40,"A"],[40,"B"],[40,"C"],[50,"G"],[60,"F"],[40,"E"]]

In [ ]:
cartoonList = np.array(cartoonList)

In [ ]:
cartoonArray= pd.DataFrame(cartoonList, index=birlesmisIndex, columns=["Yas","Meslek"])

In [ ]:
cartoonArray

In [102]:
cartoonArray.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   40      B
Marge  40      C

In [ ]:
cartoonArray.loc["South Park"].loc["Kyle"]